In [80]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from config import password

In [68]:
csv = pd.read_csv('median_income_data.csv')
csv

,"Table with row headers in column A and column headers in rows 5 and 6, and 60 and 61",Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 65,Unnamed: 66,Unnamed: 67,Unnamed: 68,Unnamed: 69,Unnamed: 70,Unnamed: 71,Unnamed: 72,Unnamed: 73,Unnamed: 74
0,Table H-8. Median Household Income by State: ...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,(Households as of March of the following year....,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,CURRENT DOLLARS,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,State,2018,NaN,2017 (40),NaN,2017,NaN,2016,NaN,2015,...,1988,NaN,1987 (21),NaN,1986,NaN,1985 (20),NaN,1984 (19),NaN
4,NaN,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,...,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
110,Wisconsin,"62,629","2,039","65,029","2,979","64,998","3,763","62,593","1,931","58,745",...,"60,525","2,001","55,913","2,990","57,970","1,761","51,879","2,591","47,882","1,895"
111,Wyoming,"62,539","3,892","60,987","3,262","59,247","3,210","60,513","3,267","64,575",...,"54,066","2,241","58,502","3,092","51,673","1,893","49,279","2,341","54,976","1,687"
112,"Source: U.S. Bureau of the Census, Current Pop...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
113,Footnotes are available at <www.census.gov/top...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
114,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [69]:
# This is how I knew which rows were specifically for Florida

# florida = csv.loc[csv['Table with row headers in column A and column headers in rows 5 and 6, and 60 and 61'] == 'Florida']
# florida

In [70]:
csv_florida = csv.iloc[[3, 4, 15, 70], :]
csv_florida

,"Table with row headers in column A and column headers in rows 5 and 6, and 60 and 61",Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 65,Unnamed: 66,Unnamed: 67,Unnamed: 68,Unnamed: 69,Unnamed: 70,Unnamed: 71,Unnamed: 72,Unnamed: 73,Unnamed: 74
3,State,2018,NaN,2017 (40),NaN,2017,NaN,2016,NaN,2015,...,1988,NaN,1987 (21),NaN,1986,NaN,1985 (20),NaN,1984 (19),NaN
4,NaN,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,...,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror
15,Florida,"54,644","1,887","53,086","1,438","53,681","1,816","51,176",835,"48,825",...,"25,406",475,"24,489",476,"22,849",540,"21,343",437,"19,785",468
70,Florida,"54,644","1,887","54,380","1,473","54,990","1,860","53,551",874,"51,750",...,"51,993",972,"51,927","1,009","50,116","1,184","47,632",975,"45,671","1,080"

In [71]:
all_na = csv_florida.dropna(axis='columns')
all_na

,Unnamed: 1,Unnamed: 3,Unnamed: 5,Unnamed: 7,Unnamed: 9,Unnamed: 11,Unnamed: 13,Unnamed: 15,Unnamed: 17,Unnamed: 19,...,Unnamed: 55,Unnamed: 57,Unnamed: 59,Unnamed: 61,Unnamed: 63,Unnamed: 65,Unnamed: 67,Unnamed: 69,Unnamed: 71,Unnamed: 73
3,2018,2017 (40),2017,2016,2015,2014,2013 (39),2013 (38),2012,2011,...,1993 (23),1992 (22),1991,1990,1989,1988,1987 (21),1986,1985 (20),1984 (19)
4,Median\nincome,Median\nincome,Median\nincome,Median\nincome,Median\nincome,Median\nincome,Median\nincome,Median\nincome,Median\nincome,Median\nincome,...,Median\nincome,Median\nincome,Median\nincome,Median\nincome,Median\nincome,Median\nincome,Median\nincome,Median\nincome,Median\nincome,Median\nincome
15,"54,644","53,086","53,681","51,176","48,825","46,140","48,532","47,886","46,071","45,105",...,"28,550","27,349","27,252","26,685","26,085","25,406","24,489","22,849","21,343","19,785"
70,"54,644","54,380","54,990","53,551","51,750","48,988","52,400","51,703","50,480","50,468",...,"48,992","48,114","49,136","49,864","51,147","51,993","51,927","50,116","47,632","45,671"

In [72]:
# fl_homeless_new = csv_florida.transpose()
# fl_homeless_new

fl_homeless_new = all_na.T.reset_index(); 
fl_income_table = fl_homeless_new[fl_homeless_new.columns[::-1]]
fl_income_table.head()

       70      15               4          3       index
0  54,644  54,644  Median\nincome       2018  Unnamed: 1
1  54,380  53,086  Median\nincome  2017 (40)  Unnamed: 3
2  54,990  53,681  Median\nincome       2017  Unnamed: 5
3  53,551  51,176  Median\nincome       2016  Unnamed: 7
4  51,750  48,825  Median\nincome       2015  Unnamed: 9

In [48]:
arbitrary = fl_income_table.drop(columns =['index'])
arbitrary.head()

        70      15              4              3
0   54,644  54,644  Median\nincome           2018
1   54,380  53,086  Median\nincome      2017 (40)
2   54,990  53,681  Median\nincome           2017
3   53,551  51,176  Median\nincome           2016
4   51,750  48,825  Median\nincome           2015
5   48,988  46,140  Median\nincome           2014
6   52,400  48,532  Median\nincome      2013 (39)
7   51,703  47,886  Median\nincome      2013 (38)
8   50,480  46,071  Median\nincome           2012
9   50,468  45,105  Median\nincome           2011
10  50,860  44,066  Median\nincome      2010 (37)
11  53,535  45,631  Median\nincome      2009 (36)
12  52,444  44,857  Median\nincome           2008
13  55,596  45,794  Median\nincome           2007
14  57,026  45,676  Median\nincome           2006
15  55,412  42,990  Median\nincome           2005
16  54,017  40,535  Median\nincome  2004(revised)
17  53,338  38,972  Median\nincome           2003
18  53,222  38,024  Median\nincome           2002
19  51,782  36,421  Median\nincome           2001
20  56,817  38,856  Median\nincome      2000 (30)
21  54,171  35,831  Median\nincome      1999 (29)
22  53,901  34,909  Median\nincome           1998
23  50,791  32,455  Median\nincome           1997
24  48,989  30,641  Median\nincome           1996
25  48,822  29,745  Median\nincome      1995 (25)
26  49,241  29,294  Median\nincome      1994 (24)
27  48,992  28,550  Median\nincome      1993 (23)
28  48,114  27,349  Median\nincome      1992 (22)
29  49,136  27,252  Median\nincome           1991
30  49,864  26,685  Median\nincome           1990
31  51,147  26,085  Median\nincome           1989
32  51,993  25,406  Median\nincome           1988
33  51,927  24,489  Median\nincome      1987 (21)
34  50,116  22,849  Median\nincome           1986
35  47,632  21,343  Median\nincome      1985 (20)
36  45,671  19,785  Median\nincome      1984 (19)

In [73]:
arbitrary.to_csv('florida_income_csv_cleaning', index=False)

In [74]:
dirty_csv = pd.read_csv('florida_income_csv_cleaning')
dirty_csv.head()

       70      15               4          3
0  54,644  54,644  Median\nincome       2018
1  54,380  53,086  Median\nincome  2017 (40)
2  54,990  53,681  Median\nincome       2017
3  53,551  51,176  Median\nincome       2016
4  51,750  48,825  Median\nincome       2015

In [75]:
dirty_csv.rename(columns = {'70': 'Florida', '15': 'Florida_Too', '4': 'Median_Income', '3': 'Year'}, inplace = True)
dirty_csv
dirty_csv.to_csv('final_median_income_csv', index=False)

In [76]:
clean_csv = pd.read_csv('final_median_income_csv')
clean_csv.head()

  Florida Florida_Too   Median_Income       Year
0  54,644      54,644  Median\nincome       2018
1  54,380      53,086  Median\nincome  2017 (40)
2  54,990      53,681  Median\nincome       2017
3  53,551      51,176  Median\nincome       2016
4  51,750      48,825  Median\nincome       2015

In [103]:
# Hey guess what!?
# pgAdmin doesn't like commas...

narrowed_df = clean_csv.drop(['Median_Income'], axis=1)
narrowed_df.rename(columns = {'Florida': 'national_average', 'Florida_Too': 'median_income', 'Year': 'year'}, inplace = True)
narrowed_df.head()

  national_average median_income       year
0           54,644        54,644       2018
1           54,380        53,086  2017 (40)
2           54,990        53,681       2017
3           53,551        51,176       2016
4           51,750        48,825       2015

In [106]:
# Getting rid of them over here
national_average = narrowed_df['national_average'].str.replace("," , "")

In [108]:
# Getting rid of commas right hereeeee...
median_income = narrowed_df['median_income'].str.replace("," , "")

In [126]:
# Turns out pgAdmin doesn't like "( )" either
# So we're removing those here...
year = narrowed_df['year'].str.replace(r"\s*\([^()]*\)","").str.strip()

In [131]:
# Going to have to add them back into the dataframe after they're all cleaned up
median_incomes_florida = pd.DataFrame ({
    'national_average': national_average,
    'median_income': median_income,
    'year': year
})

twelve_yrs = median_incomes_florida.head(12)
twelve_yrs

   national_average median_income  year
0             54644         54644  2018
1             54380         53086  2017
2             54990         53681  2017
3             53551         51176  2016
4             51750         48825  2015
5             48988         46140  2014
6             52400         48532  2013
7             51703         47886  2013
8             50480         46071  2012
9             50468         45105  2011
10            50860         44066  2010
11            53535         45631  2009

In [120]:
postgres_conn_string = f"postgres:{password}" 
engine = create_engine(f"postgresql://{postgres_conn_string}@localhost:5432/housing", paramstyle="format")

In [132]:
twelve_yrs.to_sql(name='incomes', con=engine, if_exists='append', index=False)

In [133]:
pd.read_sql_query('SELECT * FROM incomes', con=engine).head()

   national_average  median_income  year
0             54644          54644  2018
1             54380          53086  2017
2             54990          53681  2017
3             53551          51176  2016
4             51750          48825  2015